scr1c/Documents/РегистрацияПроезда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РегистрацияПроезда</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыЗаПроезд</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТСЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаПрицепа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаГруза1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаГруза2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаГруза3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

scr1c/InformationRegisters/ТарифНаПереправу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТарифНаПереправу</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

scr1c/Documents/РегистрацияПроезда/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция КонтрагентТС(ТС)
	Возврат Новый Структура("Владелец,Масса",ТС.Владелец,ТС.масса);
КонецФункции   

&НаСервереБезКонтекста
Функция ПолучитьТариф(КА,ТС)
	
	Возврат РегистрыСведений.ТарифНаПереправу.ПолучитьТариф(КА,ТС.Номенклатура);
	
	
КонецФункции
 
&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	 
	сткРекТС = КонтрагентТС(Объект.ТС);
	объект.Контрагент = сткРекТС.Владелец;
	Если сткРекТС.масса<>0 Тогда
		Объект.МассаТС = сткРекТС.масса;
	КонецЕсли;
	объект.Тариф = ПолучитьТариф(объект.Контрагент,Объект.ТС);    
	
	рез = ПроверкаПередЗаписью(объект.Контрагент,Объект.ТС); 
	Если рез<>"" Тогда
		ПоказатьПредупреждение(,рез);
	КонецесЛИ;
	
	МассаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура МассаПриИзменении(Элемент=Неопределено) 
	Объект.Масса = Объект.МассаГруза1 + Объект.МассаГруза2 + Объект.МассаГруза3 + Объект.МассаТС + Объект.МассаПрицепа;
	
	Объект.Сумма = Объект.Тариф * Объект.Масса;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	рез = ПроверкаПередЗаписью(объект.Контрагент,Объект.ТС); 
	Если рез<>"" Тогда
		ПоказатьПредупреждение(,рез);  
		Сообщить(рез);
		отказ=истина;
	КонецесЛИ;
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПроверкаПередЗаписью(КА,ТС)
	
	рез = "";
	Если КА.Заблокирован Тогда
		рез = рез +" Контрагент "+КА+" заблокирован!
		| "+Ка.причинаБлокировки+Символы.ПС;
	КонецесЛИ;   
	
	Если ТС.Активен=ложь Тогда
		рез = рез +" ТС "+ТС.Код+" "+ТС+" неактивен";
	КонецесЛИ;                           
	
	Возврат рез; 
	
КонецФункции

&НаКлиенте  
Процедура ДоступностьФормы()
	
	Если Объект.НомерЧекаККМ=0 ТОгда Возврат; КонецеслИ;  
	
	Элементы.ФормаПробитьЧек.видимость = ЛОжь;
		
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПредставлениеТС(ТС)
	
	Возврат ""+ТС.Код;	
	
КонецФункции

&НаКлиенте
Функция ТекстТалона()
	
	Текст = "Талон №"+Объект.Номер+"
	|"+Объект.Дата+" 
	|----------------------
	|Организация : ООО ""ЕТК""
	| 
	|"+Объект.Номенклатура+"
	|
	|    Клиент: "+СокрлП(Объект.Контрагент)+"
	|
	|    Автомобиль: "+СокрЛП(Объект.ТС) + "
	//|
	//|    Масса: "+Объект.Масса+" Тн.
	//|
	//|----------------------
	//|
	|
	|";
	
	Возврат Текст;
	
КонецФункции    

&НаКлиенте
Функция ТекстТалона2()
	
	Текст = "
	|      "+ПредставлениеТС(Объект.ТС) + "
	|
	|    Масса: "+Объект.Масса+" Тн.
	|
	//|----------------------
	//|
	|
	|";
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура ПробитьЧек(Команда) 
	
	ЭтаФорма.Записать();
	
	COM_port = "13";
	
	FR = Новый COMОбъект("AddIn.Fptr10");            
	FR.setSingleSetting(FR.LIBFPTR_SETTING_MODEL, Строка(FR.LIBFPTR_MODEL_ATOL_AUTO));
	FR.setSingleSetting(FR.LIBFPTR_SETTING_PORT, Строка(FR.LIBFPTR_PORT_COM));
	FR.setSingleSetting(FR.LIBFPTR_SETTING_COM_FILE, "COM"+COM_port); //СОМ порт кассы - например "COM4"
	FR.setSingleSetting(FR.LIBFPTR_SETTING_BAUDRATE, Строка(FR.LIBFPTR_PORT_BR_115200));
	FR.applySingleSettings();   

	Если FR.open()<>0 Тогда // Отправка команды на кассу
		Result=FR.errorCode();
		Сообщить(FR.errorDescription());
		FR.cancelReceipt();  //Отмена чека в случае неудачи
		Возврат;
	КонецЕсли;  
	
	FR.beginNonfiscalDocument();
	
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, ТекстТалона());
	FR.printText();      
	
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_HEIGHT, Истина);
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_WIDTH, Истина);
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, ТекстТалона2());
	FR.printText();      
	
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_HEIGHT, ложь);
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_WIDTH, ложь);
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, СокрЛП(Объект.Ответственный));
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, "----------------------");
	FR.printText();      
	
	FR.endNonfiscalDocument();  
	
	
//FR.setParam(FR.LIBFPTR_PARAM_DATA_TYPE, FR.LIBFPTR_DT_STATUS);
FR.setParam(FR.LIBFPTR_PARAM_FN_DATA_TYPE, FR.LIBFPTR_FNDT_LAST_DOCUMENT);
//FR.queryData();
FR.fnQueryData();
	
	
КонецПроцедуры
